#+BEGIN_EXPORT html
---
layout: page
title: Code Wars Dissection
tagline: " with TDD approach"
permalink: /python/tdd/code-wars-with-tdd.html
categories: [Python, TDD, Emacs, Elpy]
tags: [efficiency, software development]
---
#+END_EXPORT

#+STARTUP: showall indent
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t eval:no-export
#+TOC: headlines 2
* #1 Vowels counter

** Description
   #+BEGIN_QUOTE
   Return the number (count) of vowels in the given string.
   We will consider a, e, i, o, and u as vowels for this Kata.
   #+END_QUOTE

** Solution 001
   #+BEGIN_SRC python :results output :exports both :tangle CodeWars/functions.py :comments link
     def getCount(inputStr):
         num_vowels = 0
         # your code here
         for letter in inputStr:
             list_of_vowels = ['a', 'e', 'i', 'o', 'u']
             if letter.lower() in list_of_vowels:
                 num_vowels += 1
                 # print(letter)
                 # print(num_vowels)
         return num_vowels


     input_string = 'John the dully boy write this book'

     print(getCount(input_string))
     assert (getCount(input_string) == 9)
   #+END_SRC

   #+RESULTS:
   : 9

** TODO Test 001
#+begin_src python :results output :exports both :tangle CodeWars/tests/test_number_vowels.py :comments link
  import unittest
  from CodeWars.functions import getCount, input_string

  class TestNumberVowelsInString(unittest.TestCase):

      def setUp(self):
          self.variable_inside_test_suite = "Alioth"

      def test_innate_variable(self):
          self.assertEqual(getCount(self.variable_inside_test_suite), 3)
          #pass

      def test_imported_values(self):
          print("Hello, its the first test!")
          self.assertEqual(getCount(input_string), 9)
#+end_src

#+RESULTS:
: 9

* 
